spec/vcr/Spree_Calculator_AvalaraTransactionCalculator/_compute/when_computing_a_line_item/when_tax_is_included_in_price/should_be_equal_to_the_previous_included_tax_total_is_order_is_at_address.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R710648903","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #48 - 8155","TaxCode":"PC030000","ItemCode":"SKU-50","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R710648903","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '813'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:37:10 GMT
      Content-Length:
      - '564'
      Set-Cookie:
      - TS017f1821=01a8ddc44e3409dde30237df2837feed64dca6b07ecdc9d6db84895535e5d5e6c926555e369240e90172b2b34ea5282233b2740659;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++erC78+n+wcOde/rF06zlL/Z2dh9s7xxs7+zhizfFIm/abLEKv3qz
        d+/RvQePdnfH9/fv7d7bffBT3Lhqs/J4Ua2XLZo/HH8qMPDx06KZmi927Ken
        7/LFqi2qZfjxm+xdNikZnQAIfY7Pdsb3DvzPTrJyui4J/1nwbfbuebHMG/rs
        ewlRBX+8qOivj3a3n59pC0OOlyc793bo0Y+zSVEW7TW+aet1jk+fEPazrL5+
        nl/mJb44ns1qpWt/GP3hAmg4pFeEMf7eGe/sU9emmXxkxzA4uKd5mxWlHd4J
        uqsZ5a9eo8mr/EIxOn6Ov7+zrovmzfWK+3zdEkT7qaHCzi4+IthfA1UG9CJb
        cLvj58dPjr84xufUzH2avn5z/OY0fXP8e3/0S5LvJ/i/NFFiutnSD+jPjx7u
        3k9fp9/Jpm+bapm+bgFVvzaIPyUmxccnOmlfVMv2olrkRA982iXNy4p4ujQv
        3/t0d2cfH3cpRnjJR2dM+72d+3sPHj7ENzxY8/7O7u7O7v1dkOWXJKP3xv3L
        urjAxz/3uJvJiKiCX5L8P6Y2hV9YBAAA
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:37:11 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R710648903","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #48 - 8155","TaxCode":"PC030000","ItemCode":"SKU-50","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":100.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R710648903","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1161'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:37:11 GMT
      Content-Length:
      - '687'
      Set-Cookie:
      - TS017f1821=01a8ddc44e9dd7fd65c5961314b131fbc42d1992ddcd0b6093172adbe1e4184b907486fac6287730071bb6f29aec926f2ff5f7d3ef;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++erC78+n+wcOde/rF06zlL/Z2dh9s7xxs7+zhizfFIm/abLEKv3qz
        d+/RvQePdvfG9Nnuw4d7P8WNqzYrjxfVetmi+e7O/fGDB/aLp0UzNV/t2E9P
        3+WLVVtUy/DjN9m7bFIyQh0w9A0+3R/vMebms5OsnK5LGsMs+DZ797xY5g19
        9r2EKIM/XlT010e728/PtIUhycuTnXs79OjH2aQoi/Ya37T1OsenTwj/WVZf
        P88v8xJfHM9mtdK2P5D+gAFUBvVw/CnT9xVhjL93xjv71LVpJh/dO9A/w8F5
        XzzN26wo7fBO0F3NKH/1Gk1e5ReK0fFz/P2ddV00b65X3OfrliDaTw0Vdnbx
        EcH+GqgyoBfZgtsdPz9+cvzFMT6nZu7T9PWb4zen6Zvj3/ujX5J8P/klyYgw
        9yfm2St9x6D07BV1R49+/LM7MZ+Od+/jsw3DvTc+4Cb0Zzgz3hc/lJl5D1wZ
        kpuEW07N9xNpouR0gqQf0J8fPdy9n75Ov5NN3zbVMn3dAqp+bTB/SjoEH5/o
        tH1RLduLapETQfBplzYvK1I5pXn53qe7O/v4uEsywks+OmPi7+3c33vw8CG+
        4cGa90lB7eze3wVZhNcUOXy3++nOTvoyXy6b6/IyWxZZenyZpy++CyDazIBh
        GTAD+G7WzIvlRUvo4NPNAyDEqG/6WLDFR09P8HdnAA/3+8gT7voQ8mY2Iqr6
        lyT/D1lcGE74BQAA
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:37:12 GMT
recorded_with: VCR 3.0.3
