spec/vcr/Spree_Calculator_AvalaraTransactionCalculator/_compute/when_computing_a_line_item/when_tax_is_included_in_price/should_be_equal_to_the_previous_included_tax_total_is_order_is_at_cart.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R367762495","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #47 - 8737","TaxCode":"PC030000","ItemCode":"SKU-49","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R367762495","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '813'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:37:08 GMT
      Content-Length:
      - '564'
      Set-Cookie:
      - TS017f1821=01a8ddc44ec909bd0cd49d065f48aee73842aa1ed18a94cd49c680af47d00ff6ec7483bd1384d95a342a0da6c879eaf1e7dedc428f;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvbr36YMHn+7tP7z/
        0Yi/eJq1/MXezu6D7Z2D7Z09fPGmWORNmy1W4Vdv9u49uvfg0c7D8YO9+5/u
        3d//KW5ctVl5vKjWyxbNH44/FRj4+GnRTM0XO/bT03f5YtUW1TL8+E32LpuU
        jE4AhD7HZzvjewf+ZydZOV2XhP8s+DZ7NzCm7N3zYpk39M33EqIK/nhR0V8f
        7W4/P9MWhk4vT3bu7dCjH2eToizaa3zT1uscnz6hYc2y+vp5fpmX+OJ4Nqvz
        psF3/EY4kFeK0854Z5/gGsDykWDepxXhEx1jhH406rzNitIOjz75Gji8yi8U
        7PFz/H0ChGoe+Fev8cF31nXRvLleMaDXLSCaT19kC/70+Pnxk+Mvju3nhqY7
        u/iIOnQN09dvjt+cpm+Of++Pfkny/QT/lyZKTDdb+gH9+dHD3fvp6/Q72fRt
        Uy3T1y2g6temq6fEvfj4RCfti2rZXlSLnEaCT7uDelkRs5fm5Xuf7u7s4+Mu
        MQgv+eiMZ2Nv5/7eg4cP8U1nnLs7u/d3QeBfkozeG/cv6+ICH//c486T8Spv
        1mVrvn+9nk4J149+SfL/AO4wCmhYBAAA
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:37:09 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R367762495","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #47 - 8737","TaxCode":"PC030000","ItemCode":"SKU-49","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":100.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R367762495","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1161'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:37:10 GMT
      Content-Length:
      - '688'
      Set-Cookie:
      - TS017f1821=01a8ddc44e63b01dc024a991107e641aa72bb51b799b95c7d6ebd14e6b870ae4e61c7d5cceb8882f8d86c176c3426924a3fc578524;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1fZq1/Onezu6D7Z2D7Z09fPGmWORNmy1W4Vdv9u49uvfg0e7OeH9v58GD
        e3s/xY2rNiuPF9V62aL57s798YMH9ounRTM1X+3YT0/f5YtVW1TL8OM32bts
        UjJCHTD0DT7dH+/d8z87ycrpuqQxzIJvs3fxcdGADRle3fv0wYNP9/Yf3scX
        9MbzYpk39M33EiIZ/nhR0V8f7W4/P9MW5tWXJzv3dujRj7NJURbtNb5p63WO
        T5/QiGdZff08v8xLfHE8m9VK9P7Q+yQCUCHDw/GnjPkrHc/OeGefujbN5KN7
        B/pnSA7vi6d5mxWlHd4JuqsZ5a9eo8mr/EIxOn6Ov7+zrovmzfWK+3zdEkT7
        qaHCzi4+IthfA1UG9CJbcLvj58dPjr84xufUzH2avn5z/OY0fXP8e3/0S5Lv
        J78kGRHm/sQ8e6XvGJSevaLu6NGPf3Yn5tPxLrPOhuHeGx9wE/oznBnvix/K
        zLwHrgzJTcItp+b7iTRRcjpB0g/oz48e7t5PX6ffyaZvm2qZvm4BVb82mD8l
        rYOPT3TavqiW7UW1yIkg+LRLm5cVKanSvHzv092dfXzcJRnhJR+dMfH3du7v
        PXj4EN/wYM37O7u7O7v3d0EW4TVFDt/tfrqzk77Ml8vmurzMlkWWHl/m6Yvv
        Aog2M2BYBswAvps182J50RI6+HTzAAgx6ps+Fmzx0dMT/N0ZwMP9PvKEuz6E
        PGbk/wFPeiFa+AUAAA==
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:37:10 GMT
recorded_with: VCR 3.0.3
