spec/vcr/Spree_Calculator_AvalaraTransactionCalculator/_compute/when_computing_a_line_item/when_tax_is_not_included_in_price/should_be_equal_to_the_previous_additional_tax_total_is_order_is_at_address.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R049067344","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #51 - 8602","TaxCode":"PC030000","ItemCode":"SKU-53","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R049067344","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '814'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:37:16 GMT
      Content-Length:
      - '561'
      Set-Cookie:
      - TS017f1821=01a8ddc44e0e4706a2ffebdcd6fcc056b8f03b7595c5e13a7687c2525fe0f501a6d11aa6d3e1d361ded385bf11b351b6e58fc63fbe;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2tl/uPPpg3v7+/rF06zlL/Z2dh9s7xxs7+zhizfFIm/abLEKv3qz
        d+/RvQePdj8dH+zt7z948PCnuHHVZuXxolovWzTf3bEfPi2aqfnYfXr6Ll+s
        2qJahh+/yd5lk5KR8UDQp/hkZ8wIm49OsnK6Lgn1mf9l9u55scwb+uh7CdED
        f7yo6K+Pdrefn2kLQ4iXJzv3dujRj7NJURbtNb5p63WOT58Q5rOsvn6eX+Yl
        vjiezWqlaH8I/aECqD+cV4Qu/toZ7+xTx/wZNZKPzACGBvY0b7OitEM7QVc1
        o/vVazR5lV8oNsfP8fd31nXRvLlecY+vWwJoPzUU2NnFRwT7fdFkKC+yBTc7
        fn785PiLY3xOrdyn6es3x29O0zfHv/dHvyT5foL/SxOlopsm/YD+/Ojh7v30
        dfqdbPq2qZbp6xZQ9WuD9VPiS3x8orP1RbVsL6pFTsTAp126vKyIjUvz8r1P
        d3d4CF1yEV7y0RnTfW/n/t6Dhw/xDQ/WvL+zu7uze38XVPklyei9cf+yLi7w
        8c897mYyItL/S5L/B10mAO9LBAAA
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:37:16 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R049067344","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #51 - 8602","TaxCode":"PC030000","ItemCode":"SKU-53","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":100.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R049067344","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1163'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:37:17 GMT
      Content-Length:
      - '665'
      Set-Cookie:
      - TS017f1821=01a8ddc44e6b18fea329a06212d65637a67205a32797f9146941c41b69c299ecf517957987641835dc3504da391de76f5b2f36e622;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2tl/uPPpg3v7+/rF06zlL/Z2dh9s7xxs7+zhizfFIm/abLEKv3qz
        d+/RvQePdh+M93f2Dz699+lPceOqzcrjRbVetmi+u7tjP31aNFPzufv09F2+
        WLVFtQw/fpO9yyYlY+PDoI/x0f6YUTYfnWTldF0S8jP/y+zd82KZN/TR9xKi
        CP54UdFfH+1uPz/TFoYUL0927u3Qox9nk6Is2mt809brHJ8+IdRnWX39PL/M
        S3xxPJvVStP+GPpjBVAdD3/witDFXzvjnX3qmD+jRvKRGUA4MPf507zNitIO
        7QRd1YzuV6/R5FV+odgcP8ff31nXRfPmesU9vm4JoP3UUGBnFx8R7PdFk6G8
        yBbc7Pj58ZPjL47xObVyn6av3xy/OU3fHP/eH/2S5PvJL0lGhLY/I89e6TsG
        n2evqDd69OOf5RnhTzaMlUdKv4cTYj794UwH43MTjgzE0f2Ws/H9RJooBZ3Q
        6AcGq6ekCACtN8KXFWmI0jS79+nuDmPTHTh1IR+dMf32du7vPXj4EN8w3ub9
        HRL53fs0Yh6e4oAvHu7eT1+n38mmb5tqmb4WXJQtvqiW7UW1yAktYS99zwBl
        XXYD4oSQ9ClY4qOnJ/i7g/jD/T7ShLM++Eo75y8+3dlJX+bLZXNdXmbLIkuP
        L/P0xXfRzCD/3ayZF8uLlvp0sxFRx78k+X8AgsvkFtwFAAA=
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:37:17 GMT
recorded_with: VCR 3.0.3
