spec/vcr/Spree_Calculator_AvalaraTransactionCalculator/_compute/when_computing_a_line_item/when_tax_is_not_included_in_price/should_be_equal_to_the_previous_additional_tax_total_is_order_is_at_cart.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R862824355","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #50 - 776","TaxCode":"PC030000","ItemCode":"SKU-52","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R862824355","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '813'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:37:14 GMT
      Content-Length:
      - '557'
      Set-Cookie:
      - TS017f1821=01a8ddc44eaa1be1efcdd81d87f3076b350fcacb3330f8405e1badbb5d541f555852a5c3bd03a9ae4cc153b396962eda6880cd7680;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvTr4dO9gb//e/fsf
        jfiLp1nLX+zt7D7Y3jnY3tnDF2+KRd602WIVfvVm796jew8e7d4f7zx8uPvg
        YPenuHHVZuXxolovWzTf3bEfPi2aqfnYfXr6Ll+s2qJahh+/yd5lk5KR8UDQ
        p/hkZ7zvf3SSldN1SajP/C+zdwOjyd49L5Z5Q998LyF64I8XFf310e728zNt
        YSj08mTn3g49+nE2KcqivcY3bb3O8ekTGtIsq6+f55d5iS+OZ7M6bxp8x2/4
        g3ilGO2Md/YJKn9GjeQjRrtPJEImNr4I3WjEeZsVpR0affK+/b/KLxTm8XP8
        fQJkah7xV6/xwXfWddG8uV4xnNctAJpPX2QL/vT4+fGT4y+O7eeGmDu7+Ij6
        cw3T12+O35ymb45/749+SfL9BP+XJkpFN036Af350cPd++nr9DvZ9G1TLdPX
        LaDq16arp8Sw+PhEZ+uLatleVIucRoJPu4N6WRF/l+ble5/u7kSJQXjJR2c8
        E3s79/cePHyIbzrj3N3Zvb8L+v6SZPTeuH9ZFxf4+Oced56MV3mzLlvz/ev1
        dEq4fvRLkv8HMJnVwEsEAAA=
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:37:15 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R862824355","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #50 - 776","TaxCode":"PC030000","ItemCode":"SKU-52","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":100.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R862824355","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1162'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:37:15 GMT
      Content-Length:
      - '675'
      Set-Cookie:
      - TS017f1821=01a8ddc44ef556f3fc5f21f96b99563de5ba6ad9195c1960873d5b851c474bfecef0dbcfaecdbece5a7bb9410858d9e5476f78f517;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++Ovh072Bv/979+/rF06zlL/Z2dh9s7xxs7+zhizfFIm/abLEKv3qz
        d+/RvQePdu+PH9y7t7P38N5PceOqzcrjRbVetmi+u7tjP31aNFPzufv09F2+
        WLVFtQw/fpO9yyYlY+PDoI/x0f543//oJCun65KQn/lfZu+eF8u8oY++lxBF
        8MeLiv76aHf7+Zm2MKR4ebJzb4ce/TibFGXRXuObtl7n+PQJoT7L6uvn+WVe
        4ovj2axWmvbH0B8rgOp4+INXhC7+2hnv7FPH/Bk1ko/MAMKBuc+f5m1WlHZo
        J+iqZnS/eo0mr/ILxeb4Of7+zroumjfXK+7xdUsA7aeGAju7+Ihgvy+aDOVF
        tuBmx8+Pnxx/cYzPqZX7NH395vjNafrm+Pf+6Jck309+STIitP0ZefZK3zH4
        PHtFvdGjH/8szwh/smGsPFL6PZwQ8+kPZzoYn5twZCCO7recje8n0kQp6IRG
        P6A/P3q4ez99nX4nm75tqmX6ugVU/dog/ZT0BD4+0Zn6olq2F9UiJ1rg0y5Z
        XlakVkrz8r1Pd3d4CF1qEV7y0RkTfW/n/t6Dhw/xDQ/WvL9DemL3PpFphwYF
        9lLk8N3upzs76ct8uWyuy8tsWWTp8WWevvgugGgzA4ZVnhnAd7NmXiwvWkIH
        n24eACFGfdPHgi0+enqCvzsDeLjfR55w14eQN7MRUce/JPl/ALfB2CncBQAA
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:37:15 GMT
recorded_with: VCR 3.0.3
