spec/vcr/Spree_Calculator_AvalaraTransactionCalculator/_compute/when_computing_a_line_item/when_tax_is_not_included_in_price/when_the_line_item_is_discounted/should_be_equal_to_the_item_s_pre-tax_total_rate.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R796350459","DocDate":"2020-04-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #40 - 6244","TaxCode":"PC030000","ItemCode":"SKU-42","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R796350459","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      User-Agent:
      - rest-client/2.1.0 (darwin18.7.0 x86_64) ruby/2.5.0p0
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '814'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 02 Apr 2020 19:47:20 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '559'
      Connection:
      - keep-alive
      Server:
      - Microsoft-IIS/8.5
      Cache-Control:
      - private
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
    body:
      encoding: ASCII-8BIT
      string: |
        {
        "DocCode": "R796350459",
        "DocDate": "2020-04-02",
        "Timestamp": "2020-04-02T19:47:15.0440895Z",
        "TotalAmount": "10",
        "TotalDiscount": "0",
        "TotalExemption": "0",
        "TotalTaxable": "10",
        "TotalTax": "0.4",
        "TotalTaxCalculated": "0.4",
        "TaxLines": [
        {
        "LineNo": "1-LI",
        "TaxCode": "PC030000",
        "Taxability": "true",
        "BoundaryLevel": "Address",
        "Exemption": "0",
        "Discount": "0",
        "Taxable": "10",
        "Rate": "0.040000",
        "Tax": "0.4",
        "TaxCalculated": "0.4",
        "TaxDetails": [
        {
        "Country": "US",
        "Region": "AL",
        "JurisType": "State",
        "JurisCode": "01",
        "Taxable": "10",
        "Rate": "0.040000",
        "Tax": "0.4",
        "JurisName": "ALABAMA",
        "TaxName": "AL STATE TAX"}
        ]
        }
        ]
        ,
        "TaxAddresses": [
        {
        "Address": "915 S Jackson St",
        "AddressCode": "Dest",
        "City": "Montgomery",
        "Country": "US",
        "PostalCode": "36104",
        "Region": "AL",
        "TaxRegionId": "2052799",
        "JurisCode": "0110151000"}
        ,{
        "Address": "915 S Jackson St",
        "AddressCode": "Orig",
        "City": "Montgomery",
        "Country": "US",
        "PostalCode": "36104",
        "Region": "AL",
        "TaxRegionId": "2052799",
        "JurisCode": "0110151000"}
        ]
        ,
        "TaxDate": "2020-04-02",
        "ResultCode": "Success"}
    http_version: null
  recorded_at: Thu, 02 Apr 2020 19:47:21 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R796350459","DocDate":"2020-04-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #40 - 6244","TaxCode":"PC030000","ItemCode":"SKU-42","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":100.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R796350459","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      User-Agent:
      - rest-client/2.1.0 (darwin18.7.0 x86_64) ruby/2.5.0p0
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1163'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 02 Apr 2020 19:47:22 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '674'
      Connection:
      - keep-alive
      Server:
      - Microsoft-IIS/8.5
      Cache-Control:
      - private
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
    body:
      encoding: ASCII-8BIT
      string: |
        {
        "ResultCode": "Success",
        "DocCode": "R796350459",
        "DocDate": "2020-04-02",
        "Timestamp": "2020-04-02T19:47:27.1695245Z",
        "TotalAmount": "110",
        "TotalDiscount": "0",
        "TotalExemption": "0",
        "TotalTaxable": "110",
        "TotalTax": "4.4",
        "TotalTaxCalculated": "4.4",
        "TaxLines": [
        {
        "LineNo": "1-LI",
        "TaxCode": "PC030000",
        "Taxability": "true",
        "BoundaryLevel": "Address",
        "Exemption": "0",
        "Discount": "0",
        "Taxable": "10",
        "Rate": "0.040000",
        "Tax": "0.4",
        "TaxCalculated": "0.4",
        "TaxDetails": [
        {
        "Country": "US",
        "Region": "AL",
        "JurisType": "State",
        "JurisCode": "01",
        "Taxable": "10",
        "Rate": "0.040000",
        "Tax": "0.4",
        "JurisName": "ALABAMA",
        "TaxName": "AL STATE TAX"}
        ]
        }
        ,{
        "LineNo": "1-FR",
        "TaxCode": "FR000000",
        "Taxability": "true",
        "BoundaryLevel": "Address",
        "Exemption": "0",
        "Discount": "0",
        "Taxable": "100",
        "Rate": "0.040000",
        "Tax": "4",
        "TaxCalculated": "4",
        "TaxDetails": [
        {
        "Country": "US",
        "Region": "AL",
        "JurisType": "State",
        "JurisCode": "01",
        "Taxable": "100",
        "Rate": "0.040000",
        "Tax": "4",
        "JurisName": "ALABAMA",
        "TaxName": "AL STATE TAX"}
        ]
        }
        ]
        ,
        "TaxAddresses": [
        {
        "Address": "915 S Jackson St",
        "AddressCode": "Dest",
        "City": "Montgomery",
        "Country": "US",
        "PostalCode": "36104",
        "Region": "AL",
        "TaxRegionId": "2052799",
        "JurisCode": "0110151000"}
        ,{
        "Address": "1600 Pennsylvania Ave NW",
        "AddressCode": "2",
        "City": "Washington",
        "Country": "US",
        "PostalCode": "20500",
        "Region": "DC",
        "TaxRegionId": "949",
        "JurisCode": "1100000000"}
        ]
        ,
        "TaxDate": "2020-04-02"}
    http_version: null
  recorded_at: Thu, 02 Apr 2020 19:47:22 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R796350459","DocDate":"2020-04-02","Discount":"2.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #40 - 6244","TaxCode":"PC030000","ItemCode":"SKU-42","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":true,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":100.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R796350459","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      User-Agent:
      - rest-client/2.1.0 (darwin18.7.0 x86_64) ruby/2.5.0p0
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1162'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 02 Apr 2020 19:47:24 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '677'
      Connection:
      - keep-alive
      Server:
      - Microsoft-IIS/8.5
      Cache-Control:
      - private
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
    body:
      encoding: ASCII-8BIT
      string: |
        {
        "ResultCode": "Success",
        "DocCode": "R796350459",
        "DocDate": "2020-04-02",
        "Timestamp": "2020-04-02T19:47:20.388292Z",
        "TotalAmount": "110",
        "TotalDiscount": "2",
        "TotalExemption": "0",
        "TotalTaxable": "108",
        "TotalTax": "4.32",
        "TotalTaxCalculated": "4.32",
        "TaxLines": [
        {
        "LineNo": "1-LI",
        "TaxCode": "PC030000",
        "Taxability": "true",
        "BoundaryLevel": "Address",
        "Exemption": "0",
        "Discount": "2",
        "Taxable": "8",
        "Rate": "0.040000",
        "Tax": "0.32",
        "TaxCalculated": "0.32",
        "TaxDetails": [
        {
        "Country": "US",
        "Region": "AL",
        "JurisType": "State",
        "JurisCode": "01",
        "Taxable": "8",
        "Rate": "0.040000",
        "Tax": "0.32",
        "JurisName": "ALABAMA",
        "TaxName": "AL STATE TAX"}
        ]
        }
        ,{
        "LineNo": "1-FR",
        "TaxCode": "FR000000",
        "Taxability": "true",
        "BoundaryLevel": "Address",
        "Exemption": "0",
        "Discount": "0",
        "Taxable": "100",
        "Rate": "0.040000",
        "Tax": "4",
        "TaxCalculated": "4",
        "TaxDetails": [
        {
        "Country": "US",
        "Region": "AL",
        "JurisType": "State",
        "JurisCode": "01",
        "Taxable": "100",
        "Rate": "0.040000",
        "Tax": "4",
        "JurisName": "ALABAMA",
        "TaxName": "AL STATE TAX"}
        ]
        }
        ]
        ,
        "TaxAddresses": [
        {
        "AddressCode": "Dest",
        "City": "Montgomery",
        "Country": "US",
        "PostalCode": "36104",
        "Region": "AL",
        "TaxRegionId": "2052799",
        "JurisCode": "0110151000",
        "Address": "915 S Jackson St"}
        ,{
        "AddressCode": "2",
        "City": "Washington",
        "Country": "US",
        "PostalCode": "20500",
        "Region": "DC",
        "TaxRegionId": "949",
        "JurisCode": "1100000000",
        "Address": "1600 Pennsylvania Ave NW"}
        ]
        ,
        "TaxDate": "2020-04-02"}
    http_version: null
  recorded_at: Thu, 02 Apr 2020 19:47:24 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R796350459","DocDate":"2020-04-02","Discount":"2.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #40 - 6244","TaxCode":"PC030000","ItemCode":"SKU-42","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":true,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":100.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R796350459","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      User-Agent:
      - rest-client/2.1.0 (darwin18.7.0 x86_64) ruby/2.5.0p0
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1162'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 02 Apr 2020 19:47:25 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '683'
      Connection:
      - keep-alive
      Server:
      - Microsoft-IIS/8.5
      Cache-Control:
      - private
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
    body:
      encoding: ASCII-8BIT
      string: |
        {
        "ResultCode": "Success",
        "DocCode": "R796350459",
        "DocDate": "2020-04-02",
        "Timestamp": "2020-04-02T19:47:28.7173738Z",
        "TotalAmount": "110",
        "TotalDiscount": "2",
        "TotalExemption": "0",
        "TotalTaxable": "108",
        "TotalTax": "4.32",
        "TotalTaxCalculated": "4.32",
        "TaxLines": [
        {
        "LineNo": "1-LI",
        "TaxCode": "PC030000",
        "Taxability": "true",
        "BoundaryLevel": "Address",
        "Exemption": "0",
        "Discount": "2",
        "Taxable": "8",
        "Rate": "0.040000",
        "Tax": "0.32",
        "TaxCalculated": "0.32",
        "TaxDetails": [
        {
        "Country": "US",
        "Region": "AL",
        "JurisType": "State",
        "JurisCode": "01",
        "Taxable": "8",
        "Rate": "0.040000",
        "Tax": "0.32",
        "JurisName": "ALABAMA",
        "TaxName": "AL STATE TAX"}
        ]
        }
        ,{
        "LineNo": "1-FR",
        "TaxCode": "FR000000",
        "Taxability": "true",
        "BoundaryLevel": "Address",
        "Exemption": "0",
        "Discount": "0",
        "Taxable": "100",
        "Rate": "0.040000",
        "Tax": "4",
        "TaxCalculated": "4",
        "TaxDetails": [
        {
        "Country": "US",
        "Region": "AL",
        "JurisType": "State",
        "JurisCode": "01",
        "Taxable": "100",
        "Rate": "0.040000",
        "Tax": "4",
        "JurisName": "ALABAMA",
        "TaxName": "AL STATE TAX"}
        ]
        }
        ]
        ,
        "TaxAddresses": [
        {
        "Address": "915 S Jackson St",
        "AddressCode": "Dest",
        "City": "Montgomery",
        "Country": "US",
        "PostalCode": "36104",
        "Region": "AL",
        "TaxRegionId": "2052799",
        "JurisCode": "0110151000"}
        ,{
        "Address": "1600 Pennsylvania Ave NW",
        "AddressCode": "2",
        "City": "Washington",
        "Country": "US",
        "PostalCode": "20500",
        "Region": "DC",
        "TaxRegionId": "949",
        "JurisCode": "1100000000"}
        ]
        ,
        "TaxDate": "2020-04-02"}
    http_version: null
  recorded_at: Thu, 02 Apr 2020 19:47:25 GMT
recorded_with: VCR 5.1.0
