spec/vcr/Spree_Calculator_AvalaraTransactionCalculator/_compute/when_given_a_shipment/included_in_price/should_be_equal_to_3_85.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R231722702","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #57 - 6074","TaxCode":"PC030000","ItemCode":"SKU-59","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R231722702","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '813'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:37:29 GMT
      Content-Length:
      - '562'
      Set-Cookie:
      - TS017f1821=01a8ddc44e335a4bc230b348cb9222872e7f6b05145035c1bb4e193fcfd68fea7b5887837480e4f1f73496eeedc3f5a36c7485a5db;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2ru3+2Bv78HOnn7xNGv5i72d3QfbOwfb8sWbYpE3bbZYhV+92bv3
        6N6DR/d2xrsPd/YfPtj/KW5ctVl5vKjWyxbNH44/FRj4+GnRTM0XO/bT03f5
        YtUW1TL8+E32LpuUjE4AhD7HZzvjewf+ZydZOV2XhP8s+DZ797xY5g199r2E
        qII/XlT010e728/PtIUhx8uTnXs79OjH2aQoi/Ya37T1OsenTwj7WVZfP88v
        8xJfHM9mtdK1P4z+cAE0HNIrwhh/74x39qlr00w+smMYHNzTvM2K0g7vBN3V
        jPJXr9HkVX6hGB0/x9/fWddF8+Z6xX2+bgmi/dRQYWcXHxHsr4EqA3qRLbjd
        8fPjJ8dfHONzauY+TV+/OX5zmr45/r0/+iXJ9xP8X5ooMd1s6Qf050cPd++n
        r9PvZNO3TbVMX7eAql8bxJ8Sk+LjE520L6ple1EtcqIHPu2S5mVFPF2al+99
        uruzj4+7FCO85KMzpv3ezv29Bw8f4hserHl/Z3d3Z/f+LsjyS5LRe+P+ZV1c
        4OOfe9zNZERUwS9J/h/OsfldWAQAAA==
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:37:30 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R231722702","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #57 - 6074","TaxCode":"PC030000","ItemCode":"SKU-59","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":100.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R231722702","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1161'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:37:30 GMT
      Content-Length:
      - '711'
      Set-Cookie:
      - TS017f1821=01a8ddc44ec98207b19a3e51a9e59cc6f5c407edbe2e1ca4a46366f5e48a135027a35c881e8058ed41af374df45200e950ba73423c;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvdq7t/tgb+/Bzt5H
        I/7iadbyF3s7uw+2dw625Ys3xSJv2myxCr96s3fv0b0Hj+7tjA92dw/27+39
        FDeu2qw8XlTrZYvmuzv3xw8e2C+eFs3UfLVjPz19ly9WbVEtw4/fZO+ySckI
        dcDQN/h0f7x3z//sJCun65LGMAu+zd4NjCt797xY5g19872EKIM/XlT010e7
        28/PtIWh1cuTnXs79OjH2aQoi/Ya37T1OsenT2hgs6y+fp5f5iW+OJ7N6rxp
        8B2/IUN5OP6Ue3+lOO2Md/YJrgEsH907wJ99ahE+wRhNywgFadR5mxWlHR59
        8jVweJVfKNjj5/j7BAjVPPCvXuOD76zronlzvWJAr1tANJ++yBb86fHz4yfH
        Xxzbzw1Nd3bxEXXoGqav3xy/OU3fHP/eH/2S5PvJL0lGhLk/Mc9e6TsGyLNX
        hDg9+vF7TkyfcDGiW7p9Ot69j882EO7e+ICb0J/hXHlfdGamR9Mu0ZlqcRob
        Mlhafh1cGZKbBDtb1Mx92pua7yfSRMnpBEk/oD8/erh7P32dfiebvm2qZfq6
        BVT92mD+lJQLPj7RafuiWrYX1SInguDTLm1eVqSLSvPyvU93d/bxcZdkhJd8
        dMbE39u5v/fg4UN8w4M17+/s7u7s3t8FWYTXFDl8t/vpzk76Ml8um+vyMlsW
        WXp8macvvgsg2syAYWkyA/hu1syL5UVL6ODTzQMgxKhv+liwxUdPT/B3ZwAP
        9/vIE+76EPI8G6/yZl225vvX6+mUkPzolyT/D3K+pXn4BQAA
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:37:31 GMT
recorded_with: VCR 3.0.3
