spec/vcr/Spree_Calculator_AvalaraTransactionCalculator/_compute/when_given_an_order/when_computing_an_order/should_raise_error.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R977265338","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #45 - 1719","TaxCode":"PC030000","ItemCode":"SKU-47","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R977265338","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '814'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:37:05 GMT
      Content-Length:
      - '557'
      Set-Cookie:
      - TS017f1821=01a8ddc44e9c0eae54949bed872417c734e0fd087ae07f10059f6305ec1a2b7c814846d9bc3f9cb0b168e1c9914a2415cb2afdf36d;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvXr44MHep/fv3Tv4
        aMRfPM1a/mJvZ/fB9s7B9s4evnhTLPKmzRar8Ks3e/ce3XvwaOf++OHu/sHD
        /b2f4sZVm5XHi2q9bNF8d8d++LRopuZj9+npu3yxaotqGX78JnuXTUpGxgNB
        n+KTnfG+/9FJVk7XJaE+87/M3g2MJnv3vFjmDX3zvYTogT9eVPTXR7vbz8+0
        haHQy5Odezv06MfZpCiL9hrftPU6x6dPaEizrL5+nl/mJb44ns3qvGnwHb/h
        D+KVYrQz3tknqPwZNZKPGO0+kQiZ2PgidKMR521WlHZo9Mn79v8qv1CYx8/x
        9wmQqXnEX73GB99Z10Xz5nrFcF63AGg+fZEt+NPj58dPjr84tp8bYu7s4iPq
        zzVMX785fnOavjn+vT/6Jcn3E/xfmigV3TTpB/TnRw9376ev0+9k07dNtUxf
        t4CqX5uunhLD4uMTna0vqmV7US1yGgk+7Q7qZUX8XZqX7326uxMlBuElH53x
        TOzt3N978PAhvumMc3dn9/4u6PtLktF74/5lXVzg45973HkyXuXNumzN96/X
        0ynh+tEvSf4fKkwpX0sEAAA=
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:37:06 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R977265338","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #45 - 1719","TaxCode":"PC030000","ItemCode":"SKU-47","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":100.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R977265338","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1163'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:37:05 GMT
      Content-Length:
      - '674'
      Set-Cookie:
      - TS017f1821=01a8ddc44e5d16bd80d0052afeabc012e9c2001e9bf203243754ce9fdf12ada8a87b9a61ae7d88a6de0793a7fb478fbf923f6eb12d;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1fZq1/Onezu6D7Z2D7Z09fPGmWORNmy1W4Vdv9u49uvfg0c6n4/sP7h3s
        7e7+FDeu2qw8XlTrZYvmu7s79tOnRTM1n7tPT9/li1VbVMvw4zfZu2xSMjY+
        DPoYH+2P9/2PTrJyui4J+Zn/ZfYuPh4aqBn+q4cPHux9ev/evQN8QW88L5Z5
        Q998LyFS4Y8XFf310e728zNtYV59ebJzb4ce/TibFGXRXuObtl7n+PQJDXaW
        1dfP88u8xBfHs1mtxO6Puk8dAFUK8AevdDQ745196pg/o0bykRlySAr3+dO8
        zYrSDu0EXdWM7lev0eRVfqHYHD/H399Z10Xz5nrFPb5uCaD91FBgZxcfEez3
        RZOhvMgW3Oz4+fGT4y+O8Tm1cp+mr98cvzlN3xz/3h/9kuT7yS9JRoS2PyPP
        Xuk7Bp9nr6g3evTjn+UZ4U82jJVHSr+HE2I+/eFMB+NzE44MxNH9lrPx/USa
        KAWd0OgH9OdHD3fvp6/T72TTt021TF+3gKpfG6SfkmbBxyc6U19Uy/aiWuRE
        C3zaJcvLihRRaV6+9+nuDg+hSy3CSz46Y6Lv7dzfe/DwIb7hwZr3d0iz7N4n
        Mu3QoMBeihy+2/10Zyd9mS+XzXV5mS2LLD2+zNMX3wUQbWbAsFIxA/hu1syL
        5UVL6ODTzQMgxKhv+liwxUdPT/B3ZwAP9/vIE+76EPKYkf8Hx8E8V9wFAAA=
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:37:06 GMT
recorded_with: VCR 3.0.3
